{
    "en": {
        "tName": "Rodolfo Lara, Automation Engineer",
        "tIndex": "CLEAN SAND",
        "tExpertise": "ABOUT ME",
        "tServices": "SERVICES",
        "tClients": "CASES",
        "tContact": "CONTACT",
        "tLanguage": "ESPAÑOL",
        "tGreetings1": "PASSION FOR ENGINEERING",
        "tGreetings2": "PASSION FOR PROGRAMMING",
        "tGreetings3": "PASSION FOR AUTOMATION",
        "tGreetings4": " ",
        "tAboutMe1": "I'm Rodolfo Lara, automation engineer based in Mexico. I've been programming, installing robots and bulding machines for the industry for over a decade",
        "tAboutMe2": "I'm passionate about engineering and it excites me to solve difficult problems in a creative manner",
        "tAboutMe3": "I'm a lifelong learner and this year, just for fun, I'm learning HTML, CSS & Javascript to build a website where I can post things about my work in engineering, programming, and electronics. I'll be fixing any bugs and problems in this page as I find them",
        "tAboutMe4": "ABOUT ME",
        "tAboutMe5": " ", 
        "tAboutMe6": " ",
        "tPLC": "PLC",
        "tPLC1": "I program a variety of PLCs and HMIs, depending on the project",
        "tPLC2": "EXPERTISE",
        "tRobots": "Robots",
        "tRobots1": "I program, install and integrate different robot brands, accross a variety of applications",
        "tVision": "Vision",
        "tVision1": "I work with different vision systems brands, in 2D applications with cameras and 3D applications using profilometers",
        "tDesign": "Electrical Design",
        "tDesign1": "I also design the electrical schematics of machinery, complying to NFPA79 & IEC standards",
        "tOther": "Other Languages",
        "tOther1": "I like to explore different programming languages and frameworks to have a better understanding on how coding works, in order to produce better code for PLCs and robots, but also to see how can I use those tools in my work, for example, to improve processes by collecting and analyzing data of the machines",
        "tBeyond": "Beyond",
        "tBeyond1": "I love innovation, so I'm exploring and developing several very promising AI ideas to integrate into factories: Processes, production, control, quality, metrology, etc.",
        "tBeyond2": "If you're interested in integrating AI into your factory or automation company, you can ask me for more information to send you presentations and videos. With the right collaborations, we could speed up the process, revolutionize the industry, make a significant impact, and change the game.",
        "tFooter1": "© 2024 , All Rights Reserved",
        "tFooter2": "Designed in My House",
        "tFooter3": "< > with ♥",
        "tServices1": "Stations, Cells and Lines",
        "tServices2": "I specialize in programming, device integration, and electric panel construction, as well as all aspects related to electrical and control systems in stations, cells, and lines (turnkey projects) across various industries, processes, and applications",
        "tServices3": "-Assembly/Manufacturing",
        "tServices4": "-Handling & Packaging",
        "tServices5": "-Automotive",
        "tServices6": "-Foundry",
        "tServices7": "-Electrical Connectors",
        "tServices8": "-Inspection & Metrology",
        "tServices9": "-White Goods",
        "tServices10": "Download my presentations:",
        "tServices11": "Electrical Design",
        "tServices12": "PLC & Robots",
        "tServices13": "Vision Systems",
        "tServices14": "Turnkey Projects*",
        "tServices15": "*I collaborate closely with talented mechanical designers and trusted manufacturing workshops, ensuring the creation of efficient and customized solutions for each project.",
        "tClients1": "Cases",
        "tClients2": "I have collaborated on engineering projects in various plants and system integrators. Below are some of the places where you can find my work. I am always open to new opportunities and challenges.",
        "tContact1": "Contact",
        "tContact2": "Have an interesting project in mind? Let's get in touch and start collaborating"
    },
    "es": {
        "tName": "Rodolfo Lara, Ingeniero de Automatización",
        "tIndex": "LIMPIAR ARENA",
        "tExpertise": "ACERCA DE MI",
        "tServices": "SERVICIOS",
        "tClients": "CASOS",
        "tContact": "CONTACTO",
        "tLanguage": "ENGLISH",
        "tGreetings1": "PASIÓN POR LA INGENIERÍA",
        "tGreetings2": "PASIÓN POR LA PROGRAMACIÓN",
        "tGreetings3": "PASIÓN POR LA AUTOMATIZACIÓN",
        "tGreetings4": " ",
        "tAboutMe1": "Soy Rodolfo Lara, ingeniero en automatización en México. He programado y construido máquinas para la industria por más de una decada.",
        "tAboutMe2": "Me apasiona la ingeniería y me emociona resolver problemas dificiles de forma creativa.",
        "tAboutMe3": "Me he pasado la vida aprendiendo y este año, solo por diversión, estoy aprendiendo HTML, CSS y Javascript para construir una página donde pueda publicar cosas de mi trabajo en la ingeniería, programación y electronica. Arreglaré los bugs y problemas de esta página en la medida que los encuentre.",
        "tAboutMe4": "ACERCA DE MÍ",
        "tAboutMe5": " ", 
        "tAboutMe6": " ",
        "tPLC": "PLC",
        "tPLC1": "Programo una variedad de PLCs y HMIs, dependiendo del proyecto",
        "tPLC2": "HABILIDADES",
        "tRobots": "Robots",
        "tRobots1": "Programo, instalo e integro diferentes marcas de robots, en una variedad de aplicaciones",
        "tVision": "Visión",
        "tVision1": "Trabajo con diferentes marcas de sistemas de visión, en aplicaciones 2D con cámaras y aplicaciones 3D utilizando perfilómetros",
        "tDesign": "Diseño Eléctrico",
        "tDesign1": "También diseño los diagramas eléctricos de maquinaria, cumpliendo con los estándares NFPA79 & IEC",
        "tOther": "Otros Lenguajes",
        "tOther1": "Me gusta explorar diferentes lenguajes de programación y frameworks para entender mejor como funciona la codificación, a fin de producir mejor código para PLCs y robots, pero también para ver cómo puedo usar esas herramientas en mi trabajo, por ejemplo, para mejorar procesos al recolectar y analizar datos de las máquinas",
        "tBeyond": "Más allá",
        "tBeyond1": "Me gusta la innovación, por lo que estoy explorando y desarrollando varias ideas muy prometedoras de IA con el fin de meterlas a las fábricas: Procesos, producción, control, calidad, metrología, etc.",        
        "tBeyond2": "Si estás interesado en integrar la IA a tu fábrica o empresa de automatización, puedes pedirme más información para enviarte presentaciones y videos. Con las colaboraciones adecuadas, podríamos acelerar el proceso, revolucionar la industria, generar un impacto significativo y cambiar el juego.",
        "tFooter1": "© 2024 , Todos los Derechos Reservados",
        "tFooter2": "Diseñado en Mi Casa ",
        "tFooter3": "< > con ❤",
        "tServices1": "Estaciones, Celdas y Líneas",
        "tServices2": "Me especializo en programación, integración de dispositivos, construcción de paneles eléctricos, así como todo lo relacionado con la parte eléctrica y de control en estaciones, celdas y líneas (proyectos llave en mano) en una variedad de industrias, procesos y aplicaciones",
        "tServices3": "-Ensamble/Manufactura",
        "tServices4": "-Manejo & Embalaje",
        "tServices5": "-Automotriz",
        "tServices6": "-Fundición",
        "tServices7": "-Conectores Eléctricos",
        "tServices8": "-Inspección & Metrología",
        "tServices9": "-Línea Blanca",
        "tServices10": "Descarga mis presentaciones:",
        "tServices11": "Diseño Eléctrico",
        "tServices12": "PLC & Robots",
        "tServices13": "Sistemas de Visión",
        "tServices14": "Proyectos Llave en Mano*",
        "tServices15": "*Colaboro estrechamente con talentosos diseñadores mecánicos y talleres de fabricación de confianza, asegurando la creación de soluciones eficientes y personalizadas para cada proyecto.",
        "tClients1": "Casos",
        "tClients2": "He colaborado en proyectos de ingeniería en diversas plantas e integradoras de sistemas. A continuación, algunos de los lugares donde puedes encontrar mi trabajo. Siempre estoy abierto a nuevas oportunidades y desafíos.",
        "tContact1": "Contacto",
        "tContact2": "¿Tienes algún proyecto interesante en mente? Pongámonos en contacto y empecemos a colaborar"
    }
}
